/* $ObjectName=MAFSettingScreen_iOS */
/* $Collection=frwk.uicontrols.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable UI Components */

/* XTIT: title in navigation bar */
"SETTINGS_TITLE" = "Settings";

/* XGRP: header for a section */
"GENERAL_SETTINGS" = "General Settings";

/* XTIT: title in navigation bar for a view containing logon related fields */
"LOGON_SETTINGS" = "Login Settings";

/* XTIT: title in navigation bar for a view containing version information */
"VERSION" = "Version";

/* XTIT: title in navigation bar for 'about' view */
"ABOUT" = "About";

/* XTIT: title in navigation bar for a view containing logon type setting */
"LOGON_TYPE" = "Login Type";

/* XLST: logon type to choose */
"BASIC_AUTH" = "Basic Authentication";

/* XLST: logon type to choose */
"SSO" = "SSO";

/* XLST: logon type to choose */
"DEMO" = "Demo";

"SERV_URL" = "Service URL";

/* XFLD: label for a field */
"USERNAME" = "User Name";

/* XFLD: label for a field */
"PASSWORD" = "Password";

"SETTINGS" = "Settings";

/* XTIT: title in navigation bar for a view containing advanced settings */
"ADVANCED_SETTINGS" = "Advanced Settings";

/* XFLD: label for a field */
"SERVER_URL" = "Server URL";

/* XFLD: label for a switch (on/off), max. approx. 18 characters */
"USE_SUP" = "Use SUP";

/* XTIT: title in navigation bar for a view containing SUP connection information */
"SUP_CONNECTION_INFO" = "SUP Connection Info";

/* XFLD: label for a field */
"SERVER_NAME" = "Server Name";

/* XFLD: label for a field */
"SERVER_PORT" = "Server Port";

/* XFLD: label for a field */
"COMPANY_ID" = "Company ID";

/* XFLD: label for a field */
"ACTIVATION_CODE" = "Activation Code";

/* XFLD: label for a field */
"URL_PREFIX" = "URL Prefix";

/* XGRP: header for a section */
"APPLICATION_SPECIFIC_SETTINGS" = "Application Specific Settings";

/* XMSG: error message title, displayed in an alert view */
"Msg_Title_Datavault_Error" = "Data Storing Error";

/* XMSG: error message details, displayed in an alert view, should not be longer than 2-3 rows */
"Msg_Datavault_Error" = "Failed to persist into secure storage.";

/* XTIT: title trait in navigation bar */
"HEADING" = "Heading";

